In [1]:
import pandas as pd

df = pd.read_csv('https://www.dropbox.com/s/vnkhtwm4m67khqb/demographic_data.csv?dl=1')

# 1. Read and Overview

### dataFrame.head()
lấy ra 5 cột đầu tiên

In [2]:
df.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

### dataFrame.tail()
lấy ra 5 cột cuối

In [3]:
df.tail()

,Country Name,Country Code,Birth rate,Internet users,Income Group
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

### dataFrame.sample()
lấy ra các cột ngẫu nhiên

In [4]:
# df.sample(number_column)
# number_column -> mặc định là một

df.sample(10)

,Country Name,Country Code,Birth rate,Internet users,Income Group
96,Kuwait,KWT,20.575,75.4600,High income
114,"Macedonia, FYR",MKD,11.222,65.2400,Upper middle income
110,Moldova,MDA,12.141,45.0000,Lower middle income
23,Bolivia,BOL,24.236,36.9400,Lower middle income
130,Netherlands,NLD,10.200,93.9564,High income
70,Greenland,GRL,14.500,65.8000,High income
153,Solomon Islands,SLB,30.578,8.0000,Lower middle income
141,Puerto Rico,PRI,10.800,73.9000,High income
44,Czech Republic,CZE,10.200,74.1104,High income
33,China,CHN,12.100,45.8000,Upper middle income

### dataFrame.shape
lấy ra số lượng cột và hàng của dataFrame dạng tuple

In [5]:
df.shape

(195, 5)

### dataFrame.info()
lấy ra thông tin của dataFrame
+ bao nhiêu trường bị null và không bị null và data type

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    195 non-null    object
 1   Country Code    195 non-null    object
 2   Birth rate      195 non-null    float64
 3   Internet users  195 non-null    float64
 4   Income Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

### dataFrame.describe()
+ mean là giá trị trung bình
+ std là độ lệch chuẩn
+ min, max là giá trị lớn nhất và nhỏ nhất

In [7]:
df['Internet users'].describe()

count    195.000000
mean      42.076471
std       29.030788
min        0.900000
25%       14.520000
50%       41.000000
75%       66.225000
max       96.546800
Name: Internet users, dtype: float64

#### lấy describe là các gia trị là dạng categorical(dạng chữ)
+ count là tổng số giá trị (có bao nhiêu giá trị)
+ unique số các giá trị khách nhau 
+ top là giá trị lặp đi lại nhiều nhất
+ freq số lần lặp của top

In [8]:
df['Income Group'].describe()

count             195
unique              4
top       High income
freq               67
Name: Income Group, dtype: object

### Mean, median, mode, range:
+ mean là giá trị trung bình của dãy số
+ mode là lặp lại nhiều nhất của dẫy số
+ median là giá trị chính giữa của dãy số
+ range là giá trị lớn nhất - giá trị nhỏ nhất

<img src="https://images.squarespace-cdn.com/content/v1/54905286e4b050812345644c/1626904601177-6NNQ5U9GIX0XKG64AB0B/Snip20210721_15.png" width="600">

### dataFrame['column-name'].unique()
lấy các giá trị unique trong dataFrame

In [9]:
df['Income Group'].unique()

array(['High income', 'Low income', 'Upper middle income',
       'Lower middle income'], dtype=object)

In [10]:
# lấy ra số giá trị unique
df['Income Group'].nunique()

4

In [11]:
# lấy ra số lần lặp của các giá trị unique
df['Income Group'].value_counts()

High income            67
Lower middle income    50
Upper middle income    48
Low income             30
Name: Income Group, dtype: int64

# 2. Selection

### df.set_index('column')

In [12]:
# set index
df.set_index('Country Name')

,Country Code,Birth rate,Internet users,Income Group
Country Name,,,,
Aruba,ABW,10.244,78.9,High income
Afghanistan,AFG,35.253,5.9,Low income
Angola,AGO,45.985,19.1,Upper middle income
Albania,ALB,12.877,57.2,Upper middle income
United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...
"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
South Africa,ZAF,20.850,46.5,Upper middle income
"Congo, Dem. Rep.",COD,42.394,2.2,Low income
Zambia,ZMB,40.471,15.4,Lower middle income
Zimbabwe,ZWE,35.715,18.5,Low income

### df.loc
+ index có thể là String hoặc int
+ syntax: df.loc[[index1, index2, index3], [colomn1, column2]]

In [13]:
# df.loc[84, 'Income Group']
df.loc[84,'Income Group']

'High income'

In [14]:
# set data cho cột
df.loc[84,'Income Group'] = 'Low income'

In [15]:
df.loc[84,'Income Group']

'Low income'

In [16]:
# df.loc[[index1, index2, index3], [colomn1, column2]]
df.loc[[84, 85], ['Country Name','Internet users']]

   Country Name  Internet users
84      Iceland         96.5468
85       Israel         70.8000

In [17]:
# Lấy tất cả
df.loc[:, 'Country Name']

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: Country Name, Length: 195, dtype: object

### df.iloc
+ tương tự như df.loc -> nhưng index là kiểu int

In [18]:
df.iloc[1, 0]

'Afghanistan'

In [19]:
df.iloc[[0, 1, 2], [0, 1, 2]]

  Country Name Country Code  Birth rate
0        Aruba          ABW      10.244
1  Afghanistan          AFG      35.253
2       Angola          AGO      45.985

# 3. sort()

In [20]:
# inplace mặc định là False
# inplace = True -> lưu lại vào DataFrame | False -> Ko lưu lại

# ascending mặc định là True
# ascending = True -> sắp xếp theo tăng dần | False -> sắp xếp theo giảm dần
df.sort_values('Internet users',  ascending=False, inplace=False)

    Country Name Country Code  Birth rate  Internet users         Income Group
84       Iceland          ISL      13.400         96.5468           Low income
22       Bermuda          BMU      10.400         95.3000          High income
131       Norway          NOR      11.600         95.0534          High income
163       Sweden          SWE      11.800         94.7836          High income
47       Denmark          DNK      10.000         94.6297          High income
..           ...          ...         ...             ...                  ...
64        Guinea          GIN      37.337          1.6000           Low income
156      Somalia          SOM      43.891          1.5000           Low income
11       Burundi          BDI      44.151          1.3000           Low income
172  Timor-Leste          TLS      35.755          1.1000  Lower middle income
52       Eritrea          ERI      34.800          0.9000           Low income

[195 rows x 5 columns]

In [21]:
# xắp sếp theo index
df.sort_index()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [22]:
df[df['Internet users'] < 50].sort_values('Internet users', ascending=False, inplace=False)

,Country Name,Country Code,Birth rate,Internet users,Income Group
146,Romania,ROU,8.800,49.7645,Upper middle income
188,West Bank and Gaza,PSE,30.394,46.6000,Lower middle income
191,South Africa,ZAF,20.850,46.5000,Upper middle income
176,Turkey,TUR,16.836,46.2500,Upper middle income
101,St. Lucia,LCA,15.430,46.2000,Upper middle income
...,...,...,...,...,...
117,Myanmar,MMR,18.119,1.6000,Lower middle income
156,Somalia,SOM,43.891,1.5000,Low income
11,Burundi,BDI,44.151,1.3000,Low income
172,Timor-Leste,TLS,35.755,1.1000,Lower middle income
52,Eritrea,ERI,34.800,0.9000,Low income

### Concat

In [23]:
df2 = pd.read_excel('data\demographic_data_2.xlsx')

In [24]:
#  
df_contac = pd.concat([df, df2], axis=0)
df_contac

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9000,High income
1,Afghanistan,AFG,35.253,5.9000,Low income
2,Angola,AGO,45.985,19.1000,Upper middle income
3,Albania,ALB,12.877,57.2000,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0000,High income
...,...,...,...,...,...
194,Zimbabwe,ZWE,35.715,18.5000,Low income
0,Air Nomads,ANM,12.300,96.5468,High income
1,Water Tribe,WTB,13.200,95.3000,Low income
2,Earth Kingdom,EKD,15.400,95.0534,Upper middle income
3,Fire Nation,FNT,16.700,94.7836,Lower middle income

##### Merge: